{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/23dc3c21-5e94-42c0-96f5-8b6cec0bad13')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/23dc3c21-5e94-42c0-96f5-8b6cec0bad13')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "Multiple Email Reports with Matching Entities",
                "description": "This rule alerts when multiple unique email reports have matching entities such as subject, sender email, sender domain, and/or IP. Investigate the email(s) based on the matched entities to correctly identify if the reported email(s) are true positive malicious.",
                "severity": "High",
                "enabled": true,
                "query": "let threshold = 3\n;\nlet reportEvents = CloudAppEvents\n    | where ActionType == \"UserSubmission\"\n    | extend InternetMessageId = extract(\"InternetMessageId\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend P1Sender = extract(\"P1Sender\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend P1SenderDomain = extract(\"P1SenderDomain\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend P2Sender = extract(\"P2Sender\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend P2SenderDomain = extract(\"P2SenderDomain\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend SenderIP = extract(\"SenderIP\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend Subject = extract(\"Subject\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | extend UserId = extract(\"UserId\\\":\\\"([^\\\"]+)\", 1, tostring(RawEventData))\n    | project\n        TimeGenerated,\n        ReportId,\n        InternetMessageId,\n        P1Sender,\n        P1SenderDomain,\n        P2Sender,\n        P2SenderDomain,\n        SenderIP,\n        Subject,\n        UserId\n;\nlet _SenderIP = reportEvents\n    | summarize Count = count_distinct(ReportId) by SenderIP\n    | where Count >= threshold\n    | project SenderIP\n;\nlet _P1Sender = reportEvents\n    | summarize Count = count_distinct(ReportId) by P1Sender\n    | where Count > threshold\n    | project P1Sender\n;\nlet _P1SenderDomain = reportEvents\n    | summarize Count = count_distinct(ReportId) by P1SenderDomain\n    | where Count > threshold\n    | project P1SenderDomain\n;\nlet _P2Sender = reportEvents\n    | summarize Count = count_distinct(ReportId) by P2Sender\n    | where Count > threshold\n    | project P2Sender\n;\nlet _P2SenderDomain = reportEvents\n    | summarize Count = count_distinct(ReportId) by P2SenderDomain\n    | where Count > threshold\n    | project P2SenderDomain\n;\nlet _Subject = reportEvents\n    | summarize Count = count_distinct(ReportId) by Subject\n    | where Count > threshold\n    | project Subject;\nreportEvents\n    | where SenderIP has_any (_SenderIP) or \n    P1Sender has_any (_P1Sender) or\n    P1SenderDomain has_any (_P1SenderDomain) or \n    P2Sender has_any (_P2Sender) or\n    P2SenderDomain has_any (_P2SenderDomain) or \n    Subject has_any (_Subject)",
                "queryFrequency": "PT30M",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDynamicProperties": []
                },
                "customDetails": {},
                "entityMappings": [
                    {
                        "entityType": "MailMessage",
                        "fieldMappings": [
                            {
                                "identifier": "Recipient",
                                "columnName": "UserId"
                            },
                            {
                                "identifier": "Subject",
                                "columnName": "Subject"
                            },
                            {
                                "identifier": "InternetMessageId",
                                "columnName": "InternetMessageId"
                            }
                        ]
                    },
                    {
                        "entityType": "SubmissionMail",
                        "fieldMappings": [
                            {
                                "identifier": "SenderIp",
                                "columnName": "SenderIP"
                            },
                            {
                                "identifier": "SubmissionId",
                                "columnName": "ReportId"
                            },
                            {
                                "identifier": "Sender",
                                "columnName": "P2Sender"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}
